; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image1 - mode
	thermograph0 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star5 - direction
	Star14 - direction
	GroundStation2 - direction
	Star12 - direction
	GroundStation13 - direction
	Star7 - direction
	GroundStation11 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Phenomenon15 - direction
	Star16 - direction
	Planet17 - direction
	Star18 - direction
	Star19 - direction
	Star20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation9)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star14)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation10)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation13)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star12)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star7)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation10)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation11)
	(calibration_target instrument3 Star7)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation9)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 GroundStation9)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation11)
)
(:goal (and
	(have_image Phenomenon15 thermograph0)
	(have_image Star16 image1)
	(have_image Planet17 image1)
	(have_image Star18 thermograph0)
	(have_image Star19 thermograph0)
	(have_image Star20 thermograph0)
	(have_image Star21 thermograph0)
))

)

; plan
1. (turn_to satellite0 groundstation9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation9)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 groundstation9)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 star16 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star16)
   goals met: 0 of 7
5. (take_image satellite0 star16 instrument0 image1)
   added: (have_image star16 image1)
   goals met: 1 of 7
6. (turn_to satellite0 planet17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 planet17)
   goals met: 1 of 7
7. (take_image satellite0 planet17 instrument0 image1)
   added: (have_image planet17 image1)
   goals met: 2 of 7
8. (turn_to satellite0 phenomenon15 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 7
9. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 7
10. (turn_to satellite0 star18 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star18)
   goals met: 3 of 7
11. (take_image satellite0 star18 instrument0 thermograph0)
   added: (have_image star18 thermograph0)
   goals met: 4 of 7
12. (turn_to satellite0 star19 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star19)
   goals met: 4 of 7
13. (take_image satellite0 star19 instrument0 thermograph0)
   added: (have_image star19 thermograph0)
   goals met: 5 of 7
14. (turn_to satellite0 star20 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 star20)
   goals met: 5 of 7
15. (take_image satellite0 star20 instrument0 thermograph0)
   added: (have_image star20 thermograph0)
   goals met: 6 of 7
16. (turn_to satellite0 star21 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star21)
   goals met: 6 of 7
17. (take_image satellite0 star21 instrument0 thermograph0)
   added: (have_image star21 thermograph0)
   goals met: 7 of 7
